assets/stage1/put/wrk-put-report
Running 30s test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 536.146ms, rate sampling interval: 1270ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.62s     1.02s    6.26s    74.82%
    Req/Sec    15.73k     9.43k   22.69k    66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.89s 
 75.000%    4.29s 
 90.000%    4.57s 
 99.000%    6.25s 
 99.900%    6.27s 
 99.990%    6.27s 
 99.999%    6.27s 
100.000%    6.27s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2287.615     0.000000          106         1.00
    2473.983     0.100000        32033         1.11
    2603.007     0.200000        64523         1.25
    2772.991     0.300000        95956         1.43
    2926.591     0.400000       127846         1.67
    3893.247     0.500000       159709         2.00
    3981.311     0.550000       175524         2.22
    4050.943     0.600000       191626         2.50
    4116.479     0.650000       208343         2.86
    4198.399     0.700000       223482         3.33
    4288.511     0.750000       239503         4.00
    4341.759     0.775000       247702         4.44
    4382.719     0.800000       255799         5.00
    4423.679     0.825000       263656         5.71
    4476.927     0.850000       271536         6.67
    4521.983     0.875000       279357         8.00
    4550.655     0.887500       283713         8.89
    4567.039     0.900000       287501        10.00
    4583.423     0.912500       291688        11.43
    4599.807     0.925000       295544        13.33
    4616.191     0.937500       299592        16.00
    6164.479     0.943750       301753        17.78
    6172.671     0.950000       303686        20.00
    6180.863     0.956250       305736        22.86
    6193.151     0.962500       307606        26.67
    6205.439     0.968750       309458        32.00
    6213.631     0.971875       310644        35.56
    6217.727     0.975000       311240        40.00
    6225.919     0.978125       312450        45.71
    6234.111     0.981250       313870        53.33
    6238.207     0.984375       314451        64.00
    6242.303     0.985938       315014        71.11
    6246.399     0.987500       315606        80.00
    6246.399     0.989062       315606        91.43
    6250.495     0.990625       316430       106.67
    6254.591     0.992188       317011       128.00
    6254.591     0.992969       317011       142.22
    6258.687     0.993750       317627       160.00
    6258.687     0.994531       317627       182.86
    6258.687     0.995313       317627       213.33
    6262.783     0.996094       318422       256.00
    6262.783     0.996484       318422       284.44
    6262.783     0.996875       318422       320.00
    6262.783     0.997266       318422       365.71
    6262.783     0.997656       318422       426.67
    6266.879     0.998047       319094       512.00
    6266.879     1.000000       319094          inf
#[Mean    =     3615.121, StdDeviation   =     1024.031]
#[Max     =     6262.784, Total count    =       319094]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  476827 requests in 30.00s, 30.47MB read
Requests/sec:  15894.42
Transfer/sec:      1.02MB