assets/stage1/put/wrk-put-report
Running 1m test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.866ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    67.41ms  322.03ms   2.44s    95.46%
    Req/Sec     2.12k     1.58k   26.44k    94.79%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.28ms
 75.000%    1.78ms
 90.000%    2.33ms
 99.000%    2.00s 
 99.900%    2.40s 
 99.990%    2.44s 
 99.999%    2.44s 
100.000%    2.44s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.067     0.000000            1         1.00
       0.425     0.100000        10020         1.11
       0.688     0.200000        20003         1.25
       0.927     0.300000        30038         1.43
       1.124     0.400000        40010         1.67
       1.276     0.500000        50006         2.00
       1.350     0.550000        55017         2.22
       1.425     0.600000        60035         2.50
       1.509     0.650000        65038         2.86
       1.627     0.700000        69995         3.33
       1.780     0.750000        74992         4.00
       1.867     0.775000        77497         4.44
       1.955     0.800000        80013         5.00
       2.042     0.825000        82502         5.71
       2.135     0.850000        85018         6.67
       2.225     0.875000        87494         8.00
       2.279     0.887500        88777         8.89
       2.333     0.900000        90002        10.00
       2.393     0.912500        91257        11.43
       2.471     0.925000        92514        13.33
       2.659     0.937500        93741        16.00
      10.991     0.943750        94365        17.78
     178.815     0.950000        94990        20.00
     463.359     0.956250        95615        22.86
     746.495     0.962500        96240        26.67
    1032.703     0.968750        96865        32.00
    1175.551     0.971875        97177        35.56
    1318.911     0.975000        97490        40.00
    1462.271     0.978125        97804        45.71
    1604.607     0.981250        98115        53.33
    1746.943     0.984375        98427        64.00
    1818.623     0.985938        98583        71.11
    1888.255     0.987500        98741        80.00
    1958.911     0.989062        98896        91.43
    2029.567     0.990625        99052       106.67
    2095.103     0.992188        99209       128.00
    2131.967     0.992969        99289       142.22
    2166.783     0.993750        99365       160.00
    2203.647     0.994531        99446       182.86
    2238.463     0.995313        99522       213.33
    2273.279     0.996094        99599       256.00
    2291.711     0.996484        99640       284.44
    2308.095     0.996875        99677       320.00
    2326.527     0.997266        99718       365.71
    2344.959     0.997656        99759       426.67
    2361.343     0.998047        99795       512.00
    2369.535     0.998242        99814       568.89
    2379.775     0.998437        99836       640.00
    2387.967     0.998633        99855       731.43
    2396.159     0.998828        99873       853.33
    2404.351     0.999023        99892      1024.00
    2410.495     0.999121        99905      1137.78
    2414.591     0.999219        99915      1280.00
    2418.687     0.999316        99924      1462.86
    2422.783     0.999414        99934      1706.67
    2426.879     0.999512        99944      2048.00
    2428.927     0.999561        99950      2275.56
    2428.927     0.999609        99950      2560.00
    2430.975     0.999658        99963      2925.71
    2430.975     0.999707        99963      3413.33
    2433.023     0.999756        99970      4096.00
    2433.023     0.999780        99970      4551.11
    2433.023     0.999805        99970      5120.00
    2435.071     0.999829        99977      5851.43
    2435.071     0.999854        99977      6826.67
    2435.071     0.999878        99977      8192.00
    2437.119     0.999890        99982      9102.22
    2437.119     0.999902        99982     10240.00
    2437.119     0.999915        99982     11702.86
    2437.119     0.999927        99982     13653.33
    2439.167     0.999939        99989     16384.00
    2439.167     1.000000        99989          inf
#[Mean    =       67.414, StdDeviation   =      322.035]
#[Max     =     2437.120, Total count    =        99989]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  119996 requests in 1.00m, 7.67MB read
Requests/sec:   1999.94
Transfer/sec:    130.86KB